EQUIPMENTS = [
    {
        "Id": 1,
        "Tier": 0,
        "Name": "下級強化石",
    },
    {
        "Id": 2,
        "Tier": 0,
        "Name": "一般強化石",
    },
    {
        "Id": 3,
        "Tier": 0,
        "Name": "高級強化石",
    },
    {
        "Id": 4,
        "Tier": 0,
        "Name": "最高級強化石",
    },
    {
        "Id": 10,
        "Tier": 0,
        "Name": "生鏽的彈簧",
    },
    {
        "Id": 11,
        "Tier": 0,
        "Name": "完整的彈簧",
    },
    {
        "Id": 12,
        "Tier": 0,
        "Name": "鉻彈簧",
    },
    {
        "Id": 13,
        "Tier": 0,
        "Name": "鈦彈簧",
    },
    {
        "Id": 20,
        "Tier": 0,
        "Name": "生鏽的錘子",
    },
    {
        "Id": 21,
        "Tier": 0,
        "Name": "完整的錘子",
    },
    {
        "Id": 22,
        "Tier": 0,
        "Name": "鉻金屬鎚子",
    },
    {
        "Id": 23,
        "Tier": 0,
        "Name": "鈦金屬鎚子",
    },
    {
        "Id": 30,
        "Tier": 0,
        "Name": "生鏽的槍管",
    },
    {
        "Id": 31,
        "Tier": 0,
        "Name": "完好的槍管",
    },
    {
        "Id": 32,
        "Tier": 0,
        "Name": "鉻金屬槍管",
    },
    {
        "Id": 33,
        "Tier": 0,
        "Name": "鈦金屬槍管",
    },
    {
        "Id": 40,
        "Tier": 0,
        "Name": "生鏽的擊針",
    },
    {
        "Id": 41,
        "Tier": 0,
        "Shops": [
            {
                "ShopCategory": "SecretStoneGrowth",
                "Released": [True, True, False],
                "Amount": 1,
                "CostType": "Item",
                "CostId": 23,
                "CostAmount": 8,
            }
        ],
        "Name": "完好的擊針",
    },
    {
        "Id": 42,
        "Tier": 0,
        "Shops": [
            {
                "ShopCategory": "SecretStoneGrowth",
                "Released": [True, True, False],
                "Amount": 1,
                "CostType": "Item",
                "CostId": 23,
                "CostAmount": 32,
            }
        ],
        "Name": "鉻金屬擊針",
    },
    {
        "Id": 43,
        "Tier": 0,
        "Shops": [
            {
                "ShopCategory": "MasterCoin",
                "Released": [True, True, False],
                "Amount": 10,
                "CostType": "Currency",
                "CostId": 18,
                "CostAmount": 1500,
            }
        ],
        "Name": "鈦金屬擊針",
    },
    {
        "Id": 1000,
        "Tier": 1,
        "Name": "素色鴨舌帽",
    },
    {
        "Id": 1001,
        "Tier": 2,
        "Name": "針織毛線帽",
    },
    {
        "Id": 1002,
        "Tier": 3,
        "Name": "老大哥軟呢帽",
    },
    {
        "Id": 1003,
        "Tier": 4,
        "Name": "蝴蝶結貝雷帽",
    },
    {
        "Id": 1004,
        "Tier": 5,
        "Name": "防彈頭盔",
    },
    {
        "Id": 1005,
        "Tier": 6,
        "Name": "荷葉邊迷你帽",
    },
    {
        "Id": 1006,
        "Tier": 7,
        "Name": "遮陽帽",
    },
    {
        "Id": 1007,
        "Tier": 8,
        "Name": "附有葉子的緞帶費多拉帽",
    },
    {
        "Id": 1008,
        "Tier": 9,
        "Name": "セーラーハット",
    },
    {
        "Id": 2000,
        "Tier": 1,
        "Name": "運動手套",
    },
    {
        "Id": 2001,
        "Tier": 2,
        "Name": "針織連指手套",
    },
    {
        "Id": 2002,
        "Tier": 3,
        "Name": "佩洛洛烤箱手套",
    },
    {
        "Id": 2003,
        "Tier": 4,
        "Name": "皮手套",
    },
    {
        "Id": 2004,
        "Tier": 5,
        "Name": "戰術手套",
    },
    {
        "Id": 2005,
        "Tier": 6,
        "Name": "蕾絲手套",
    },
    {
        "Id": 2006,
        "Tier": 7,
        "Name": "袖套",
    },
    {
        "Id": 2007,
        "Tier": 8,
        "Name": "珍珠毛線手套",
    },
    {
        "Id": 2008,
        "Tier": 9,
        "Name": "セーリンググローブ",
    },
    {
        "Id": 3000,
        "Tier": 1,
        "Name": "粉紅色休閒鞋",
    },
    {
        "Id": 3001,
        "Tier": 2,
        "Name": "雪靴",
    },
    {
        "Id": 3002,
        "Tier": 3,
        "Name": "粉紅波卡拖鞋",
    },
    {
        "Id": 3003,
        "Tier": 4,
        "Name": "古典琺瑯樂福鞋",
    },
    {
        "Id": 3004,
        "Tier": 5,
        "Name": "戰術長靴",
    },
    {
        "Id": 3005,
        "Tier": 6,
        "Name": "高跟鞋",
    },
    {
        "Id": 3006,
        "Tier": 7,
        "Name": "休閒運動鞋",
    },
    {
        "Id": 3007,
        "Tier": 8,
        "Name": "防水登山靴",
    },
    {
        "Id": 3008,
        "Tier": 9,
        "Name": "アクアサンダル",
    },
    {
        "Id": 4000,
        "Tier": 1,
        "Name": "防水運動包",
    },
    {
        "Id": 4001,
        "Tier": 2,
        "Name": "防寒斜背包",
    },
    {
        "Id": 4002,
        "Tier": 3,
        "Name": "佩洛洛背包",
    },
    {
        "Id": 4003,
        "Tier": 4,
        "Name": "海軍藍書包",
    },
    {
        "Id": 4004,
        "Tier": 5,
        "Name": "戰術後背式皮革書包",
    },
    {
        "Id": 4005,
        "Tier": 6,
        "Name": "惡魔翅膀托特包",
    },
    {
        "Id": 4006,
        "Tier": 7,
        "Name": "街頭包",
    },
    {
        "Id": 4007,
        "Tier": 8,
        "Name": "蝴蝶圖案單肩包",
    },
    {
        "Id": 4008,
        "Tier": 9,
        "Name": "スリングドライバック",
    },
    {
        "Id": 5000,
        "Tier": 1,
        "Name": "Serval金屬徽章",
    },
    {
        "Id": 5001,
        "Tier": 2,
        "Name": "Manaslu毛氈徽章",
    },
    {
        "Id": 5002,
        "Tier": 3,
        "Name": "憤怒阿德利圓形徽章",
    },
    {
        "Id": 5003,
        "Tier": 4,
        "Name": "Veronica刺繡徽章",
    },
    {
        "Id": 5004,
        "Tier": 5,
        "Name": "Kazeyama魔鬼氈臂章",
    },
    {
        "Id": 5005,
        "Tier": 6,
        "Name": "Coco Devil銀勳章",
    },
    {
        "Id": 5006,
        "Tier": 7,
        "Name": "街頭勳章",
    },
    {
        "Id": 5007,
        "Tier": 8,
        "Name": "Lorelei勳章",
    },
    {
        "Id": 5008,
        "Tier": 9,
        "Name": "ハルピュイア・フレキシブルバッジ",
    },
    {
        "Id": 6000,
        "Tier": 1,
        "Name": "網球頭帶",
    },
    {
        "Id": 6001,
        "Tier": 2,
        "Name": "髮圈",
    },
    {
        "Id": 6002,
        "Tier": 3,
        "Name": "水蜜桃髮夾",
    },
    {
        "Id": 6003,
        "Tier": 4,
        "Name": "翅膀髮夾",
    },
    {
        "Id": 6004,
        "Tier": 5,
        "Name": "多功能髮夾",
    },
    {
        "Id": 6005,
        "Tier": 6,
        "Name": "蝙蝠髮夾",
    },
    {
        "Id": 6006,
        "Tier": 7,
        "Name": "藝術字髮夾",
    },
    {
        "Id": 6007,
        "Tier": 8,
        "Name": "樹葉髮夾",
    },
    {
        "Id": 6008,
        "Tier": 9,
        "Name": "アンカーヘアピン",
    },
    {
        "Id": 7000,
        "Tier": 1,
        "Name": "交通安全符",
    },
    {
        "Id": 7001,
        "Tier": 2,
        "Name": "暖暖貼",
    },
    {
        "Id": 7002,
        "Tier": 3,
        "Name": "佩洛洛的羽毛",
    },
    {
        "Id": 7003,
        "Tier": 4,
        "Name": "十字架",
    },
    {
        "Id": 7004,
        "Tier": 5,
        "Name": "迷彩達摩",
    },
    {
        "Id": 7005,
        "Tier": 6,
        "Name": "詛咒娃娃",
    },
    {
        "Id": 7006,
        "Tier": 7,
        "Name": "便攜式除臭劑",
    },
    {
        "Id": 7007,
        "Tier": 8,
        "Name": "捕夢網",
    },
    {
        "Id": 8000,
        "Tier": 1,
        "Name": "防水電子錶",
    },
    {
        "Id": 8001,
        "Tier": 2,
        "Name": "皮革手錶",
    },
    {
        "Id": 8002,
        "Tier": 3,
        "Name": "波浪貓手錶",
    },
    {
        "Id": 8003,
        "Tier": 4,
        "Name": "骨董懷錶",
    },
    {
        "Id": 8004,
        "Tier": 5,
        "Name": "防震手錶",
    },
    {
        "Id": 8005,
        "Tier": 6,
        "Name": "哥德風手錶",
    },
    {
        "Id": 8006,
        "Tier": 7,
        "Name": "街頭時尚手錶",
    },
    {
        "Id": 8007,
        "Tier": 8,
        "Name": "Lorelei手錶",
    },
    {
        "Id": 9000,
        "Tier": 1,
        "Name": "藍牙項鍊",
    },
    {
        "Id": 9001,
        "Tier": 2,
        "Name": "雪花墜飾",
    },
    {
        "Id": 9002,
        "Tier": 3,
        "Name": "尼科萊盒式鍊墜",
    },
    {
        "Id": 9003,
        "Tier": 4,
        "Name": "十字架項鍊",
    },
    {
        "Id": 9004,
        "Tier": 5,
        "Name": "識別牌",
    },
    {
        "Id": 9005,
        "Tier": 6,
        "Name": "龐克頸圈",
    },
    {
        "Id": 9006,
        "Tier": 7,
        "Name": "鍊式項鍊",
    },
    {
        "Id": 9007,
        "Tier": 8,
        "Name": "綠葉項鍊",
    },
    {
        "Id": 101001,
        "Tier": 2,
        "Name": "針織毛線帽設計圖",
    },
    {
        "Id": 101002,
        "Tier": 3,
        "Name": "老大哥軟呢帽設計圖",
    },
    {
        "Id": 101003,
        "Tier": 4,
        "Name": "蝴蝶結貝雷帽設計圖",
    },
    {
        "Id": 101004,
        "Tier": 5,
        "Name": "防彈頭盔設計圖",
    },
    {
        "Id": 101005,
        "Tier": 6,
        "Name": "荷葉邊迷你帽設計圖",
    },
    {
        "Id": 101006,
        "Tier": 7,
        "Name": "遮陽帽設計圖",
    },
    {
        "Id": 101007,
        "Tier": 8,
        "Name": "附有葉子的緞帶費多拉帽設計圖",
    },
    {
        "Id": 101008,
        "Tier": 9,
        "Name": "セーラーハットの設計図",
    },
    {
        "Id": 102001,
        "Tier": 2,
        "Name": "針織連指手套設計圖",
    },
    {
        "Id": 102002,
        "Tier": 3,
        "Name": "佩洛洛烤箱手套設計圖",
    },
    {
        "Id": 102003,
        "Tier": 4,
        "Name": "皮手套設計圖",
    },
    {
        "Id": 102004,
        "Tier": 5,
        "Name": "戰術手套設計圖",
    },
    {
        "Id": 102005,
        "Tier": 6,
        "Name": "蕾絲手套設計圖",
    },
    {
        "Id": 102006,
        "Tier": 7,
        "Name": "袖套設計圖",
    },
    {
        "Id": 102007,
        "Tier": 8,
        "Name": "珍珠毛線手套設計圖",
    },
    {
        "Id": 102008,
        "Tier": 9,
        "Name": "セーリンググローブの設計図",
    },
    {
        "Id": 103001,
        "Tier": 2,
        "Name": "雪靴設計圖",
    },
    {
        "Id": 103002,
        "Tier": 3,
        "Name": "粉紅波卡粉紅拖鞋設計圖",
    },
    {
        "Id": 103003,
        "Tier": 4,
        "Name": "古典琺瑯樂福鞋設計圖",
    },
    {
        "Id": 103004,
        "Tier": 5,
        "Name": "戰術長靴設計圖",
    },
    {
        "Id": 103005,
        "Tier": 6,
        "Name": "高跟鞋設計圖",
    },
    {
        "Id": 103006,
        "Tier": 7,
        "Name": "休閒運動鞋設計圖",
    },
    {
        "Id": 103007,
        "Tier": 8,
        "Name": "防水登山靴設計圖",
    },
    {
        "Id": 103008,
        "Tier": 9,
        "Name": "アクアサンダルの設計図",
    },
    {
        "Id": 104001,
        "Tier": 2,
        "Name": "防寒斜背包設計圖",
    },
    {
        "Id": 104002,
        "Tier": 3,
        "Name": "佩洛洛背包設計圖",
    },
    {
        "Id": 104003,
        "Tier": 4,
        "Name": "海軍藍書包設計圖",
    },
    {
        "Id": 104004,
        "Tier": 5,
        "Name": "戰術後背式皮革書包設計圖",
    },
    {
        "Id": 104005,
        "Tier": 6,
        "Name": "魔鬼翅膀托特包設計圖",
    },
    {
        "Id": 104006,
        "Tier": 7,
        "Name": "街頭包設計圖",
    },
    {
        "Id": 104007,
        "Tier": 8,
        "Name": "蝴蝶圖案單肩包設計圖",
    },
    {
        "Id": 104008,
        "Tier": 9,
        "Name": "スリングドライバックの設計図",
    },
    {
        "Id": 105001,
        "Tier": 2,
        "Name": "Manaslu毛氈徽章設計圖",
    },
    {
        "Id": 105002,
        "Tier": 3,
        "Name": "憤怒阿德利圓形徽章設計圖",
    },
    {
        "Id": 105003,
        "Tier": 4,
        "Name": "Veronica刺繡徽章設計圖",
    },
    {
        "Id": 105004,
        "Tier": 5,
        "Name": "Kazeyama魔鬼氈臂章設計圖",
    },
    {
        "Id": 105005,
        "Tier": 6,
        "Name": "Coco Devil銀勳章設計圖",
    },
    {
        "Id": 105006,
        "Tier": 7,
        "Name": "街頭徽章設計圖",
    },
    {
        "Id": 105007,
        "Tier": 8,
        "Name": "Lorelei徽章設計圖",
    },
    {
        "Id": 105008,
        "Tier": 9,
        "Name": "ハルピュイア・フレキシブルバッジの設計図",
    },
    {
        "Id": 106001,
        "Tier": 2,
        "Name": "髮圈設計圖",
    },
    {
        "Id": 106002,
        "Tier": 3,
        "Name": "水蜜桃髮夾設計圖",
    },
    {
        "Id": 106003,
        "Tier": 4,
        "Name": "翅膀髮夾設計圖",
    },
    {
        "Id": 106004,
        "Tier": 5,
        "Name": "多功能髮夾設計圖",
    },
    {
        "Id": 106005,
        "Tier": 6,
        "Name": "蝙蝠髮夾設計圖",
    },
    {
        "Id": 106006,
        "Tier": 7,
        "Name": "藝術字髮夾設計圖",
    },
    {
        "Id": 106007,
        "Tier": 8,
        "Name": "樹葉髮夾設計圖",
    },
    {
        "Id": 106008,
        "Tier": 9,
        "Name": "アンカーヘアピンの設計図",
    },
    {
        "Id": 107001,
        "Tier": 2,
        "Name": "暖暖貼設計圖",
    },
    {
        "Id": 107002,
        "Tier": 3,
        "Name": "佩洛洛的羽毛設計圖",
    },
    {
        "Id": 107003,
        "Tier": 4,
        "Name": "十字架設計圖",
    },
    {
        "Id": 107004,
        "Tier": 5,
        "Name": "迷彩達摩設計圖",
    },
    {
        "Id": 107005,
        "Tier": 6,
        "Name": "詛咒娃娃設計圖",
    },
    {
        "Id": 107006,
        "Tier": 7,
        "Name": "便攜式除臭劑設計圖",
    },
    {
        "Id": 107007,
        "Tier": 8,
        "Name": "捕夢網設計圖",
    },
    {
        "Id": 108001,
        "Tier": 2,
        "Name": "皮革手錶設計圖",
    },
    {
        "Id": 108002,
        "Tier": 3,
        "Name": "波浪貓手錶設計圖",
    },
    {
        "Id": 108003,
        "Tier": 4,
        "Name": "骨董懷錶設計圖",
    },
    {
        "Id": 108004,
        "Tier": 5,
        "Name": "防震手錶設計圖",
    },
    {
        "Id": 108005,
        "Tier": 6,
        "Name": "哥德風手錶設計圖",
    },
    {
        "Id": 108006,
        "Tier": 7,
        "Name": "街頭時尚手錶設計圖",
    },
    {
        "Id": 108007,
        "Tier": 8,
        "Name": "Lorelei手錶設計圖",
    },
    {
        "Id": 109001,
        "Tier": 2,
        "Name": "雪花墜飾設計圖",
    },
    {
        "Id": 109002,
        "Tier": 3,
        "Name": "尼科萊盒式鍊墜設計圖",
    },
    {
        "Id": 109003,
        "Tier": 4,
        "Name": "十字架項鍊設計圖",
    },
    {
        "Id": 109004,
        "Tier": 5,
        "Name": "識別牌設計圖",
    },
    {
        "Id": 109005,
        "Tier": 6,
        "Name": "龐克頸圈設計圖",
    },
    {
        "Id": 109006,
        "Tier": 7,
        "Name": "鍊式項鍊設計圖",
    },
    {
        "Id": 109007,
        "Tier": 8,
        "Name": "綠葉項鍊設計圖",
    },
]

EQUIPMENT_DB = {eq["Id"]: eq["Name"] for eq in EQUIPMENTS}
